backend/app/controllers/favorites_controller.rb

    def create
        favorite = Favorite.new(favorite_params)
        # current_user.favorite.build(favorite_params)
        if favorite.save
---
INSERT INTO "favorites" ("user_id", "gift_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["gift_id", 3], ["created_at", "2020-07-28 22:10:17.838175"], ["updated_at", "2020-07-28 22:10:17.838175"]]

    def index
        user_id = params[:user_id]
        user = User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        fav_id = params[:id]
        favorite = Favorite.find(fav_id)
        favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]