backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def index
        tasks = Task.all